In [4]:
import pandas as pd

In [5]:
df=pd.read_csv('Dataset1.csv')
print(df.head())

  order_id customer_id  customer_age order_amount  order_date payment_mode  \
0  ORD1000         NaN           NaN        250.5  2023-01-15   Debit Card
1  ORD1001         NaN          18.0         1200  2023/03/10   Debit Card
2  ORD1002       CUST2          35.0          NaN         NaN          NaN
3  ORD1003      user_3          35.0         1200  2023-01-15         Cash
4  ORD1004      user_4          -3.0      3500.75  2023-01-15         CARD

     city delivery_days is_delivered
0     NaN             5         True
1     NaN             5          yes
2  Mumbai             7          yes
3     NaN         three        False
4     NaN         three          yes

# 1.identify all rows where order_amount is non-numeric but is_delivered is marked as delivered

In [6]:
# #1.identify all rows where order_amount is non-numeric but is_delivered is marked as delivered
# df['order_amount'] = pd.to_numeric(df['order_amount'], errors='coerce').astype('float')
# df['order_amount'].isna()

In [7]:

# df['is_delivered']=df['is_delivered'].replace({"yes": "true", "no": "false", True: "true", False: "false"})
# df['is_delivered']

In [8]:
df["order_amount"]=pd.to_numeric(df['order_amount'], errors='coerce').isna()
df["is_delivered"]=df["is_delivered"].astype(str).str.lower().isin(["true", "yes"])
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,False,2023/03/10,Debit Card,NaN,5,True
2,ORD1002,CUST2,35.0,True,NaN,NaN,Mumbai,7,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,15/02/2023,upi,Mumbai,1,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,50.0,True,2023/03/10,Cash,Delhi,1,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,True,15/02/2023,Debit Card,NaN,-1,True

# 2.convert order_date to datetime and find orders where delivery_date is negative after valid date conversion

In [9]:
#2 convert order_date to datetime and find orders where delivery_date is negative after valid date conversion
df['order_date']=pd.to_datetime(df['order_date'], errors='coerce', dayfirst=True)
df['order_date']

C:\Users\Arunv\AppData\Local\Temp\ipykernel_35256\1032321147.py:2: UserWarning: Parsing dates in %Y-%m-%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df['order_date']=pd.to_datetime(df['order_date'], errors='coerce', dayfirst=True)

0     2023-01-15
1            NaT
2            NaT
3     2023-01-15
4     2023-01-15
         ...
995          NaT
996   2023-01-15
997          NaT
998   2023-01-15
999          NaT
Name: order_date, Length: 1000, dtype: datetime64[ns]

In [10]:
import numpy as np
df['delivery_days']=pd.to_numeric(df['delivery_days'], errors='coerce')
df.loc[df['delivery_days']<0, 'delivery_days'] = np.nan
df['delivery_days']

0      5.0
1      5.0
2      7.0
3      NaN
4      NaN
      ...
995    1.0
996    2.0
997    1.0
998    2.0
999    NaN
Name: delivery_days, Length: 1000, dtype: float64

In [11]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5.0,True
1,ORD1001,NaN,18.0,False,NaT,Debit Card,NaN,5.0,True
2,ORD1002,CUST2,35.0,True,NaT,NaN,Mumbai,7.0,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,NaN,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,NaN,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,NaT,upi,Mumbai,1.0,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,Hyderabad,2.0,True
997,NaN,user_997,50.0,True,NaT,Cash,Delhi,1.0,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,Mumbai,2.0,False
999,NaN,user_999,120.0,True,NaT,Debit Card,NaN,NaN,True

In [12]:
df[(df['delivery_days'].notna()) & (df['delivery_days']<0)]
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5.0,True
1,ORD1001,NaN,18.0,False,NaT,Debit Card,NaN,5.0,True
2,ORD1002,CUST2,35.0,True,NaT,NaN,Mumbai,7.0,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,NaN,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,NaN,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,NaT,upi,Mumbai,1.0,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,Hyderabad,2.0,True
997,NaN,user_997,50.0,True,NaT,Cash,Delhi,1.0,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,Mumbai,2.0,False
999,NaN,user_999,120.0,True,NaT,Debit Card,NaN,NaN,True

# 3. standardize payment_mode and calculate the percentage share of each mode per city

In [13]:
#3. standardize payment_mode and calculate the percentage share of each mode per city
# a=df['payment_mode'].value_counts(normalize=True)*100
# a

df['payment_mode']=df['payment_mode'].str.lower().str.strip()
df['city']=df['city'].str.lower().str.strip()
a=df.groupby('city')['payment_mode'].value_counts(normalize=True)*100
a

city       payment_mode
bangalore  upi             32.812500
           card            19.531250
           debit card      18.750000
           cash            17.187500
           credit card     11.718750
delhi      upi             32.600733
           debit card      17.948718
           card            17.582418
           cash            16.849817
           credit card     15.018315
hyderabad  upi             30.769231
           card            19.658120
           cash            17.094017
           debit card      17.094017
           credit card     15.384615
mumbai     upi             36.160714
           cash            19.642857
           debit card      16.071429
           credit card     14.285714
           card            13.839286
Name: proportion, dtype: float64

In [14]:
counts = df.groupby(['city', 'payment_mode']).size()

total_per_city = counts.groupby(level=0).sum()

percentage = (counts / total_per_city) * 100

percentage_df= percentage.reset_index(name='percentage')
percentage_df

         city payment_mode  percentage
0   bangalore         card   19.531250
1   bangalore         cash   17.187500
2   bangalore  credit card   11.718750
3   bangalore   debit card   18.750000
4   bangalore          upi   32.812500
5       delhi         card   17.582418
6       delhi         cash   16.849817
7       delhi  credit card   15.018315
8       delhi   debit card   17.948718
9       delhi          upi   32.600733
10  hyderabad         card   19.658120
11  hyderabad         cash   17.094017
12  hyderabad  credit card   15.384615
13  hyderabad   debit card   17.094017
14  hyderabad          upi   30.769231
15     mumbai         card   13.839286
16     mumbai         cash   19.642857
17     mumbai  credit card   14.285714
18     mumbai   debit card   16.071429
19     mumbai          upi   36.160714

# 4.detect customers whose customer_age is invalid but have order amounts above the dataest median

In [15]:
# 4.detect customers whose customer_age is invalid but have order amounts above the dataest median
df['customer_age']=pd.to_numeric(df['customer_age'], errors='coerce')
df['order_amount']=pd.to_numeric(df['order_amount'], errors='coerce')
m=df['order_amount'].median()
df[(df['customer_age'].isna()) & (df['order_amount']>m)]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
9,NaN,user_9,NaN,True,NaT,upi,delhi,NaN,False
13,NaN,CUST13,NaN,True,NaT,cash,mumbai,7.0,False
24,ORD1024,CUST24,NaN,True,NaT,credit card,delhi,1.0,True
28,ORD1028,CUST28,NaN,True,NaT,cash,NaN,NaN,False
29,NaN,user_29,NaN,True,NaT,debit card,delhi,7.0,True
...,...,...,...,...,...,...,...,...,...
960,NaN,NaN,NaN,True,NaT,upi,NaN,NaN,False
964,ORD1964,NaN,NaN,True,2023-01-15,upi,mumbai,7.0,False
976,NaN,NaN,NaN,True,2023-01-15,NaN,mumbai,2.0,False
983,NaN,NaN,NaN,True,NaT,credit card,mumbai,2.0,False
992,NaN,CUST992,NaN,True,2023-01-15,card,NaN,NaN,False

# 5. find duplicate customer_ids where the same customer placed orders in multiple cities

In [18]:
#5. find duplicate customer_ids where the same customer placed orders in multiple cities
#using groupby
unique_city=df.groupby('customer_id')['city'].nunique()

cust_order=unique_city[unique_city>=1].reset_index()
cust_order

    customer_id  city
0       CUST108     1
1        CUST11     1
2       CUST111     1
3       CUST117     1
4       CUST119     1
..          ...   ...
408    user_959     1
409     user_97     1
410    user_977     1
411    user_995     1
412    user_997     1

[413 rows x 2 columns]

#  6.create a flag for orders where delivery_days is missing but is_delivered is true

In [21]:
# # 6.create a flag for orders where delivery_days is missing but is_delivered is true
df['delivery_flag'] = ((df['delivery_days'].isna()) & (df['is_delivered'] == True))
df[['delivery_flag','is_delivered','delivery_days']]

     delivery_flag  is_delivered  delivery_days
0            False          True            5.0
1            False          True            5.0
2            False          True            7.0
3            False         False            NaN
4             True          True            NaN
..             ...           ...            ...
995          False          True            1.0
996          False          True            2.0
997          False         False            1.0
998          False         False            2.0
999           True          True            NaN

[1000 rows x 3 columns]

# 7.after cleaning,compute the average order value per payment mode,excluding invalid amounts.

In [ ]:
#7.after cleaning,compute the average order value per payment mode,excluding invalid amounts.

avgorder=df.groupby('payment_mode')['order_amount'].mean().reset_index(name='average_order_value')
avgorder

  payment_mode  average_order_value
0         card             0.384106
1         cash             0.436709
2  credit card             0.479675
3   debit card             0.375887
4          upi             0.472603

# 8.identify the cities where more than 30% of orders have missing order_date

In [32]:
#8.identify the cities where more than 30% of orders have missing order_date
total_orders=df.groupby('city').size()  
missing_order=df[df['order_date'].isna()].groupby('city').size()
percentage_mis=(missing_order/total_orders)*100
above30=percentage_mis[percentage_mis>30].reset_index(name='missing_order_date_percentage')
above30

        city  missing_order_date_percentage
0  bangalore                      80.794702
1      delhi                      80.463576
2  hyderabad                      84.397163
3     mumbai                      74.242424